09-spring-soap-ws-produce/src/main/resources/testing-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getRegionRequest>
            <gs:name>Pomorskie</gs:name>
        </gs:getRegionRequest>
    </soapenv:Body>
</soapenv:Envelope>